In [1]:
import pandas as pd

In [2]:
Salary_Dataset = pd.read_csv("https://raw.githubusercontent.com/TheDataMarshal/Salary_Dataset_EDA/master/Salary_Dataset.csv", 
                             index_col = "Sr. No")
Salary_Dataset.head()

        Department  Age Gender  Annual Salary
Sr. No
1        Marketing   25      M              6
2            Sales   27      M             10
3       Operations   35      F             12
4               HR   28      F              4
5        Marketing   34      M             26

In [3]:
Salary_Dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 1 to 100
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Department     100 non-null    object
 1   Age            100 non-null    int64
 2   Gender         100 non-null    object
 3   Annual Salary  100 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.9+ KB

In [4]:
convert_dict = {'Department': str, 
                'Gender': str
               } 
  
Salary_Dataset = Salary_Dataset.astype(convert_dict)

In [5]:
Salary_Dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 1 to 100
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Department     100 non-null    object
 1   Age            100 non-null    int64
 2   Gender         100 non-null    object
 3   Annual Salary  100 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.9+ KB

In [6]:
Salary_Dataset.head(10)

        Department  Age Gender  Annual Salary
Sr. No
1        Marketing   25      M              6
2            Sales   27      M             10
3       Operations   35      F             12
4               HR   28      F              4
5        Marketing   34      M             26
6            Sales   49      M              9
7       Operations   62      F              7
8               HR   21      F              8
9        Marketing   44      M              5
10           Sales   37      F              7